RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_03.svd
          <register>
            <name>ERROR_INT_STAT_EN_R</name>
            <description>Error Interrupt Status Enable Register</description>
            <addressOffset>0x36</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_TOUT_ERR_STAT_EN</name>
                <description>Command Timeout Error Status Enable (SD/eMMC Mode
only).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_CRC_ERR_STAT_EN</name>
                <description>ommand CRC Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_END_BIT_ERR_STAT_EN</name>
                <description>Command End Bit Error Status Enable (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_IDX_ERR_STAT_EN</name>
                <description>Command Index Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_TOUT_ERR_STAT_EN</name>
                <description>Data Timeout Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_CRC_ERR_STAT_EN</name>
                <description>Data CRC Error Status Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_END_BIT_ERR_STAT_EN</name>
                <description>Data End Bit Error Status Enable (SD/eMMC Mode only).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CUR_LMT_ERR_STAT_EN</name>
                <description>Current Limit Error Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTO_CMD_ERR_STAT_EN</name>
                <description>Auto CMD Error Status Enable (SD/eMMC Mode only).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADMA_ERR_STAT_EN</name>
                <description>ADMA Error Status Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TUNING_ERR_STAT_EN</name>
                <description>Tuning Error Status Enable (UHS-I Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESP_ERR_STAT_EN</name>
                <description>Response Error Status Enable (SD Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BOOT_ACK_ERR_STAT_EN</name>
                <description>Boot Acknowledgment Error (eMMC Mode only)
Setting this bit to 1 enables setting of Boot Acknowledgment
Error in Error Interrupt Status register
(ERROR_INT_STAT_R).
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_STAT_EN1</name>
                <description>N/A</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_STAT_EN2</name>
                <description>N/A</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_STAT_EN3</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>NORMAL_INT_SIGNAL_EN_R</name>
            <description>Normal Interrupt Signal Enable Register</description>
            <addressOffset>0x38</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFF</resetMask>
            <fields>
              <field>
                <name>CMD_COMPLETE_SIGNAL_EN</name>
                <description>Command Complete Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XFER_COMPLETE_SIGNAL_EN</name>
                <description>Transfer Complete Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BGAP_EVENT_SIGNAL_EN</name>
                <description>Block Gap Event Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DMA_INTERRUPT_SIGNAL_EN</name>
                <description>DMA Interrupt Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_WR_READY_SIGNAL_EN</name>
                <description>Buffer Write Ready Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BUF_RD_READY_SIGNAL_EN</name>
                <description>Buffer Read Ready Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INSERTION_SIGNAL_EN</name>
                <description>Card Insertion Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_REMOVAL_SIGNAL_EN</name>
                <description>Card Removal Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CARD_INTERRUPT_SIGNAL_EN</name>
                <description>Card Interrupt Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_A_SIGNAL_EN</name>
                <description>N/A</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_B_SIGNAL_EN</name>
                <description>N/A</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>INT_C_SIGNAL_EN</name>
                <description>N/A</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RE_TUNE_EVENT_SIGNAL_EN</name>
                <description>N/A</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FX_EVENT_SIGNAL_EN</name>
                <description>FX Event Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CQE_EVENT_SIGNAL_EN</name>
                <description>Command Queuing Engine Event Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ERROR_INT_SIGNAL_EN_R</name>
            <description>Error Interrupt Signal Enable Register</description>
            <addressOffset>0x3A</addressOffset>
            <size>16</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CMD_TOUT_ERR_SIGNAL_EN</name>
                <description>Command Timeout Error Signal Enable (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_CRC_ERR_SIGNAL_EN</name>
                <description>Command CRC Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_END_BIT_ERR_SIGNAL_EN</name>
                <description>Command End Bit Error Signal Enable (SD/eMMC Mode
only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CMD_IDX_ERR_SIGNAL_EN</name>
                <description>Command Index Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): No error
- 0x1 (TRUE): Error</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_TOUT_ERR_SIGNAL_EN</name>
                <description>Data Timeout Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_CRC_ERR_SIGNAL_EN</name>
                <description>Data CRC Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_END_BIT_ERR_SIGNAL_EN</name>
                <description>Data End Bit Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CUR_LMT_ERR_SIGNAL_EN</name>
                <description>Current Limit Error Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AUTO_CMD_ERR_SIGNAL_EN</name>
                <description>Auto CMD Error Signal Enable (SD/eMMC Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADMA_ERR_SIGNAL_EN</name>
                <description>ADMA Error Signal Enable
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TUNING_ERR_SIGNAL_EN</name>
                <description>N/A</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESP_ERR_SIGNAL_EN</name>
                <description>Response Error Signal Enable (SD Mode only)
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BOOT_ACK_ERR_SIGNAL_EN</name>
                <description>Boot Acknowledgment Error (eMMC Mode only).
Setting this bit to 1 enables generating interrupt signal when
Boot Acknowledgement Error in Error Interrupt Status
register is set.
Values:
- 0x0 (FALSE): Masked
- 0x1 (TRUE): Enabled</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_SIGNAL_EN1</name>
                <description>N/A</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_SIGNAL_EN2</name>
                <description>N/A</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VENDOR_ERR_SIGNAL_EN3</name>
                <description>N/A</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTO_CMD_STAT_R</name>
            <description>Auto CMD Status Register</description>
            <addressOffset>0x3C</addressOffset>
            <size>16</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xBF</resetMask>
            <fields>
              <field>
                <name>AUTO_CMD12_NOT_EXEC</name>
                <description>Auto CMD12 Not Executed
If multiple memory block data transfer is not started due to a
command error, this bit is not set because it is not necessary
to issue an Auto CMD12. Setting this bit to 1 means that the
Host Controller cannot issue Auto CMD12 to stop multiple
memory block data transfer, due to some error. If this bit is
set to 1, error status bits (D04-D01) is meaningless.
This bit is set to 0 when Auto CMD Error is generated by
Auto CMD23.
Values:
- 0x1 (TRUE): Not Executed
- 0x0 (FALSE): Executed</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_TOUT_ERR</name>
                <description>Auto CMD Timeout Error
This bit is set if no response is returned with 64 SDCLK
cycles from the end bit of the command.
If this bit is set to 1, error status bits (D04-D01) are
meaningless.
Values:
- 0x1 (TRUE): Time out
- 0x0 (FALSE): No Error</description>
                <bitRange>[1:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_CRC_ERR</name>
                <description>Auto CMD CRC Error
This bit is set when detecting a CRC error in the command
response.
Values:
- 0x1 (TRUE): CRC Error Generated
- 0x0 (FALSE): No Error</description>
                <bitRange>[2:2]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_EBIT_ERR</name>
                <description>Auto CMD End Bit Error
This bit is set when detecting that the end bit of command
response is 0.
Values:
- 0x1 (TRUE): End Bit Error Generated
- 0x0 (FALSE): No Error</description>
                <bitRange>[3:3]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_IDX_ERR</name>
                <description>Auto CMD Index Error
This bit is set if the command index error occurs in response
to a command.
Values:
- 0x1 (TRUE): Error
- 0x0 (FALSE): No Error</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>AUTO_CMD_RESP_ERR</name>
                <description>Auto CMD Response Error
This bit is set when Response Error Check Enable in the
Transfer Mode register is set to 1 and an error is detected in
R1 response of either Auto CMD12 or CMD13. This status is
ignored if any bit between D00 to D04 is set to 1.
Values:
- 0x1 (TRUE): Error
- 0x0 (FALSE): No Error</description>
                <bitRange>[5:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>CMD_NOT_ISSUED_AUTO_CMD12</name>
                <description>Command Not Issued By Auto CMD12 Error
If this bit is set to 1, CMD_wo_DAT is not executed due to an
Auto CMD12 Error (D04-D01) in this register.
This bit is set to 0 when Auto CMD Error is generated by
Auto CMD23.
Values:
- 0x1 (TRUE): Not Issued
- 0x0 (FALSE): No Error</description>
                <bitRange>[7:7]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
